{
    "peft_type": "LORA",       
    "r": 8,                   
    "lora_alpha": 32,          
    "lora_dropout": 0.1,       
    "target_modules": [        
      "q_proj", 
      "v_proj"
    ],
    "bias": "none",            
    "task_type": "CAUSAL_LM", 
    "inference_mode": false    
  }